doxygen.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-01-29 Sun 17:01 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs - Doxygen</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs - Doxygen</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga83c9af">Introduction</a></li>
<li><a href="#org7461250">Syntax</a>
<ul>
<li><a href="#org318c519">Comment block</a></li>
<li><a href="#org86fe53a">Special command</a>
<ul>
<li><a href="#org8376b98">List</a></li>
<li><a href="#orgdc609b5">Group</a></li>
<li><a href="#orge85f07b">Formula</a></li>
<li><a href="#org9cfb6d4">Graph</a></li>
<li><a href="#orgfd0d3d4">Text</a></li>
<li><a href="#org9bfea52">Section</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgced6c62">Doxymacs</a>
<ul>
<li><a href="#org6db8d22">Installation</a></li>
<li><a href="#org58ac6bb">Configuration</a></li>
<li><a href="#org4acb88c">Usage</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga83c9af" class="outline-2">
<h2 id="orga83c9af">Introduction</h2>
<div class="outline-text-2" id="text-orga83c9af">
<p>
<i>Doxygen</i><sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> is a powerful tool to document the source codes. In principle, it parses the specially formated comments from the source codes and then produces very professional documents. Up to now, it is able to support almost all the popular programming languages, e.g. C/C++, Java, Python, and etc.
</p>
</div>
</div>
<div id="outline-container-org7461250" class="outline-2">
<h2 id="org7461250">Syntax</h2>
<div class="outline-text-2" id="text-org7461250">
</div>
<div id="outline-container-org318c519" class="outline-3">
<h3 id="org318c519">Comment block</h3>
<div class="outline-text-3" id="text-org318c519">
<dl class="org-dl">
<dt>Multi-line comment blocks</dt><dd>Begin with <code>/**</code> or <code>/*!</code>, and end with <code>*/</code>.</dd>
<dt>Single-line comment blocks</dt><dd>delimiters <code>///</code> or <code>//!</code>.</dd>
</dl>
</div>
</div>
<div id="outline-container-org86fe53a" class="outline-3">
<h3 id="org86fe53a">Special command</h3>
<div class="outline-text-3" id="text-org86fe53a">
<p>
Within code blocks, <i>special commands</i> can be used. They begin with a prefix <code>@</code> or <code>\</code> and optionally have arguments enclosed in braces. Moreover, different braces mean different scopes.
</p>
<ul class="org-ul">
<li>Angle braces <code>&lt; &gt;</code> mean the argument is a single word.</li>
<li>Round braces <code>( )</code> mean the argument extends to end of line.</li>
<li>Curly braces <code>{ }</code> mean the argument extends to next paragraph.</li>
</ul>
</div>
<div id="outline-container-org8376b98" class="outline-4">
<h4 id="org8376b98">List</h4>
<div class="outline-text-4" id="text-org8376b98">
<ul class="org-ul">
<li>Column aligned <code>-</code> &rarr; a unsorted/bulleted list item.</li>
<li>Column aligned <code>-#</code> &rarr; a sorted list item.</li>
</ul>
<p>
Hierachical lists can be created by using different indents for different levels.
</p>
</div>
</div>
<div id="outline-container-orgdc609b5" class="outline-4">
<h4 id="orgdc609b5">Group</h4>
<div class="outline-text-4" id="text-orgdc609b5">
<div class="org-src-container">
<pre class="src src-sh">/** \defgroup &lt;label&gt; ''&lt;title&gt;'' */
/* @{ */
   // group memebers here ...
/* @} */
</pre>
</div>
<p>
or
</p>
<div class="org-src-container">
<pre class="src src-sh">/** \defgroup &lt;label&gt; ''&lt;title&gt;'' */
// @{
   // group memebers here ...
// @}
</pre>
</div>
<p>
where the <code>title</code> is optional while the <code>label</code> is mandatory and can be used for reference by
</p>
<div class="org-src-container">
<pre class="src src-sh">\ref &lt;label&gt; ''&lt;link&gt;''
</pre>
</div>
</div>
</div>
<div id="outline-container-orge85f07b" class="outline-4">
<h4 id="orge85f07b">Formula</h4>
<div class="outline-text-4" id="text-orge85f07b">
<ul class="org-ul">
<li>Inline formula</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">\f$ ... \f$
</pre>
</div>
<ul class="org-ul">
<li>Centered formula</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">\f[ ... \f]
</pre>
</div>
</div>
</div>
<div id="outline-container-org9cfb6d4" class="outline-4">
<h4 id="org9cfb6d4">Graph</h4>
<div class="outline-text-4" id="text-org9cfb6d4">
<p>
Doxygen can automatically generate graphs by <a href="./dot.html"><i>dot</i></a> from Graphviz<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>. Additionally, mannual dot commands are enclosed between <code>\dot</code> and <code>\enddot</code>.
</p>
</div>
</div>
<div id="outline-container-orgfd0d3d4" class="outline-4">
<h4 id="orgfd0d3d4">Text</h4>
<div class="outline-text-4" id="text-orgfd0d3d4">
<ul class="org-ul">
<li><code>\a/\e &lt;word&gt;</code>: <i>word</i></li>
<li><code>\b &lt;word&gt;</code>: <b>word</b></li>
<li><code>\c &lt;word&gt;</code>: <code>word</code></li>
</ul>
</div>
</div>
<div id="outline-container-org9bfea52" class="outline-4">
<h4 id="org9bfea52">Section</h4>
<div class="outline-text-4" id="text-org9bfea52">
<ul class="org-ul">
<li><code>\attention {...}</code>: an <b>Attention</b> paragraph</li>
<li><code>\author {...}</code>: author list</li>
<li><code>\brief {...}</code>: a brief description</li>
<li><code>\bug {...}</code>: a bug description</li>
<li><code>\date {...}</code></li>
<li><code>\deprecated {...}</code>: a <b>Deprecated</b> paragraph</li>
<li><code>\note {...}</code>: a <b>Note</b> paragraph</li>
<li><code>\par (title) {...}</code>: a paragraph with a optional title</li>
<li><code>\param &lt;p&gt; {...}</code>: a description of <b>parameter</b> <code>p</code></li>
<li><code>\return {...}</code>: a description of <b>return</b> values</li>
<li><code>\remarks {...}</code>: a <b>Remarks</b> paragraph</li>
<li><code>\sa/\see {ref}</code>: a <b>See Also</b> paragraph</li>
<li><code>\todo {...}</code>: a <b>To Do</b> paragraph</li>
<li><code>\version {...}</code>: a paragraph including the version string</li>
<li><code>\warning {...}</code>: a paragraph for warning messages</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgced6c62" class="outline-2">
<h2 id="orgced6c62">Doxymacs</h2>
<div class="outline-text-2" id="text-orgced6c62">
<p>
There is a doxygen extension for <a href="http://www.gnu.org/software/emacs">Emacs</a>, <i>doxymacs</i>, which provides a minor mode for doxygen <code>doxymacs-mode</code>. Clearly, it stands for <code>doxygen</code> + <code>emacs</code>. With it, comment blocks above can be conveniently inserted.
</p>
</div>
<div id="outline-container-org6db8d22" class="outline-3">
<h3 id="org6db8d22">Installation</h3>
<div class="outline-text-3" id="text-org6db8d22">
<p>
For ArchLinux, doxymacs can be easily installed by AUR.
</p>
<div class="org-src-container">
<pre class="src src-sh">yaourt doxymacs
</pre>
</div>
</div>
</div>
<div id="outline-container-org58ac6bb" class="outline-3">
<h3 id="org58ac6bb">Configuration</h3>
<div class="outline-text-3" id="text-org58ac6bb">
<p>
After the installation, following configuration should be inserted into Emacs configuration file <code>.emacs</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'doxymacs)                                                                                              
(add-hook 'c-mode-common-hook 'doxymacs-mode)                                                                    
(defun my-doxymacs-font-lock-hook ()                                                                             
  (if (or (eq major-mode 'c-mode) (eq major-mode 'c++-mode))
      (doxymacs-font-lock)))
(add-hook 'font-lock-mode-hook 'my-doxymacs-font-lock-hook)
</pre>
</div>
</div>
</div>
<div id="outline-container-org4acb88c" class="outline-3">
<h3 id="org4acb88c">Usage</h3>
<div class="outline-text-3" id="text-org4acb88c">
<p>
<code>Doxymacs-mode</code> provides following key bindings.
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Binding</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-c d ;</code></td>
<td class="org-left">doxymacs-insert-member-comment</td>
</tr>

<tr>
<td class="org-left"><code>C-c d ?</code></td>
<td class="org-left">doxymacs-lookup</td>
</tr>

<tr>
<td class="org-left"><code>C-c d @</code></td>
<td class="org-left">doxymacs-insert-grouping-comments</td>
</tr>

<tr>
<td class="org-left"><code>C-c d f</code></td>
<td class="org-left">doxymacs-insert-function-comment</td>
</tr>

<tr>
<td class="org-left"><code>C-c d i</code></td>
<td class="org-left">doxymacs-insert-file-comment</td>
</tr>

<tr>
<td class="org-left"><code>C-c d m</code></td>
<td class="org-left">doxymacs-insert-blank-multiline-comment</td>
</tr>

<tr>
<td class="org-left"><code>C-c d r</code></td>
<td class="org-left">doxymacs-rescan-tags</td>
</tr>

<tr>
<td class="org-left"><code>C-c d s</code></td>
<td class="org-left">doxymacs-insert-blank-singleline-comment</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="http://www.doxygen.nl">http://www.doxygen.nl</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="http://www.graphviz.org">http://www.graphviz.org</a>
</p></div></div>


</div>
</div></div>
</body>
</html>